{
  "backend/main.mo": "Main Motoko actor for the Viral Growth OS backend, handling user subscriptions, profiles, brand voice, content generation requests, and Stripe checkout integration with role-based access control.",
  "feature_evidence.json": "JSON report mapping implemented feature IDs to their associated source files, component dependencies, test IDs, and confidence levels for build verification.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file, serving as a quick reference for the purpose and recent changes of every component, page, hook, and config file.",
  "frontend/docs/DEPLOYMENT.md": "Step-by-step guide for deploying the Viral Growth OS to the Internet Computer mainnet, covering DFX CLI setup, cycles wallet requirements, and identity configuration.",
  "frontend/docs/STRIPE_SETUP.md": "Guide for creating Pro and Elite subscription products in Stripe, configuring webhooks, updating backend price IDs, and testing the checkout flow with test card details.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title, viewport meta, and mounting the React root div with the main module script.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes, wraps the app in ThemeProvider and QueryClientProvider, and renders the Toaster notification component.",
  "frontend/src/components/ContentOutput.tsx": "Displays generated content (hooks, scripts, captions) in cards with copy-to-clipboard functionality, meta badges for platform/niche/tone, and upgrade prompts for locked features.",
  "frontend/src/components/ContentScoreCard.tsx": "Renders a card showing hook strength, retention potential, and monetization potential as color-coded progress bars with an averaged overall score.",
  "frontend/src/components/CountdownTimer.tsx": "Displays a promotional countdown timer set 7 days from page load, showing days/hours/minutes/seconds with an expiry message when the deadline passes.",
  "frontend/src/components/FeatureCarousel.tsx": "Auto-advancing image carousel showcasing three product features (hooks, scripts, monetization) with navigation controls, pause-on-hover, and dot indicators.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with animated headline, subtext, and a CTA button that links authenticated users to /generate or unauthenticated users to /pricing.",
  "frontend/src/components/LandingPageNav.tsx": "Scroll-spy navigation bar for the landing page that highlights the active section and smoothly scrolls to it on click.",
  "frontend/src/components/Layout.tsx": "App shell with a sticky header containing the logo, context-aware navigation (landing vs. app pages), admin links, and an Internet Identity login/logout button with mobile menu support.",
  "frontend/src/components/LegalDisclaimer.tsx": "Small alert component displaying a legal notice reminding users they are responsible for compliance of the content they create.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and email on first visit, saving the profile via the `useSaveCallerUserProfile` mutation with toast feedback.",
  "frontend/src/components/TestimonialsSection.tsx": "A landing-page section displaying three creator testimonials in animated cards with star ratings, quotes, and author info.",
  "frontend/src/components/UpgradePrompt.tsx": "A small UI component that displays a locked-feature message and a styled upgrade button linking to the pricing page for a given feature and required tier.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCarousel.ts": "A hook managing carousel state with auto-advance interval, manual next/prev/goTo navigation, and pause/resume controls.",
  "frontend/src/hooks/useCountdown.ts": "A hook that counts down to a target date, returning days/hours/minutes/seconds updated every second along with an `isExpired` flag.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the authenticated caller's user profile from the backend actor, merging actor-loading state into the query's loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profile, subscription, Stripe checkout, content generation, and admin operations.",
  "frontend/src/hooks/useRippleEffect.ts": "A hook that attaches a CSS ripple animation to a button element on click, respecting the user's reduced-motion preference.",
  "frontend/src/hooks/useScrollAnimation.ts": "Provides two React hooks using IntersectionObserver: `useScrollAnimation` adds an 'in-view' class to a single element when it enters the viewport, and `useScrollAnimationGroup` does the same for multiple child elements within a container. Both respect the `prefers-reduced-motion` media query.",
  "frontend/src/hooks/useScrollSpy.ts": "React hook that uses IntersectionObserver to track which of a list of section IDs is currently visible in the viewport, returning the active section ID as state.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light and dark color themes using OKLCH values, and declares keyframe animations (fade-in, slide-up, ripple, etc.) used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` for React Query and `InternetIdentityProvider` for authentication wrapping the root `App` component.",
  "frontend/src/pages/ContentGenerator.tsx": "Page component that provides a form for authenticated users to generate viral content (hooks, scripts, captions) by selecting niche, platform, tone, audience, and goal, then calling backend mutation hooks and displaying results via `ContentOutput`. Unauthenticated users are redirected to pricing.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page for authenticated users showing their subscription tier, enabled features, and content request history, with loading skeletons and a profile setup modal for new users. Unauthenticated users see a prompt to get started.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page composed of a hero section, stats bar, feature grid, how-it-works steps, testimonials, and a countdown timer, using scroll animation hooks and ripple effects for interactivity.",
  "frontend/src/pages/PaymentFailure.tsx": "Static page shown after a cancelled or failed payment, informing the user they were not charged and providing buttons to retry on the pricing page or return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Page shown after a successful payment that invalidates subscription and feature-set queries to refresh state, then displays a confirmation message with links to the dashboard and content generator.",
  "frontend/src/pages/PricingPage.tsx": "Renders a three-tier pricing page (Free, Pro, Elite) with plan details, features, and locked items. Handles plan selection by initiating a Stripe checkout session or redirecting unauthenticated users to login.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe integration, allowing entry and saving of a Stripe secret key and allowed countries. Displays current configuration status and webhook URL guidance for production deployments.",
  "frontend/src/pages/SubscriptionManagement.tsx": "Displays the authenticated user's current subscription tier, its features, and available feature flags. Provides an upgrade link for non-elite users and invalidates subscription queries on mount to ensure fresh data.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both standard query strings and hash-based routing, with helpers to persist values in sessionStorage and clean sensitive parameters from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based color tokens, vibrant palette colors, custom fonts (Inter, Syne), glow box shadows, and keyframe animations like fade-in, float, and ripple.",
  "project_state.json": "Tracks project state version 3, summarizing features like animations, hero section, testimonials, countdown timer, carousel, and smooth scroll navigation, along with image requirements and architectural notes."
}