{
  "backend/main.mo": "Main ICP actor implementing user subscription management, content generation, Stripe checkout integration, and access control with tier-based feature sets (free/pro/elite) using HTTP outcalls to Stripe's API.",
  "feature_evidence.json": "Feature evidence report mapping two deployment-related features (canister ID in meta tag and dfx.json audit) to their associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/docs/STRIPE_SETUP.md": "Step-by-step guide for creating Pro and Elite Stripe subscription products, configuring webhooks, updating backend price IDs, and testing the checkout flow.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the React app with basic meta tags, a root div, and a module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes, wraps the app in ThemeProvider and QueryClientProvider, and renders the Toaster notification component.",
  "frontend/src/components/ContentOutput.tsx": "Displays generated content (hooks, scripts, captions) in cards with copy-to-clipboard buttons and upgrade prompts for tier-locked features like scripts and captions.",
  "frontend/src/components/ContentScoreCard.tsx": "Displays a card showing hook strength, retention potential, and monetization potential scores as progress bars, along with an average score and optional virality explanation.",
  "frontend/src/components/Layout.tsx": "Provides the main app layout with a sticky header, responsive navigation links (including admin-only Stripe Setup), and login/logout functionality via Internet Identity.",
  "frontend/src/components/LegalDisclaimer.tsx": "Renders a small amber-styled alert reminding users they are responsible for their content's compliance with laws and platform terms.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that collects a new user's name and optional email, then saves the profile via the saveCallerUserProfile mutation on first login.",
  "frontend/src/components/UpgradePrompt.tsx": "Displays a locked-feature placeholder with the required subscription tier and a button linking to the pricing page for upgrading.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the current authenticated user's profile from the backend actor, accounting for actor loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context provider and hook, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks and mutations for backend interactions including user profile, subscription, admin checks, Stripe configuration, and content generation.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines light/dark theme CSS custom properties (colors, radius, chart, sidebar) using oklch color space, plus a fade-in animation utility.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with TanStack QueryClientProvider and a custom InternetIdentityProvider for authentication.",
  "frontend/src/pages/ContentGenerator.tsx": "Page component that lets authenticated users fill out a content generation form (niche, platform, tone, audience, goal) and calls backend mutation hooks to generate hooks, scripts, and captions, displaying results or upgrade prompts.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing the authenticated user's subscription tier, enabled feature set, and content request history, with a profile setup modal triggered for new users.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showcasing product features, a step-by-step how-it-works section, and CTAs directing users to sign up or view pricing.",
  "frontend/src/pages/PaymentFailure.tsx": "Static page displayed after a cancelled or failed Stripe payment, offering buttons to retry checkout or return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Page shown after a successful Stripe payment that invalidates subscription/featureSet queries and provides navigation links to the dashboard or content generator.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page that renders Free, Pro, and Elite plan cards with feature lists and handles plan selection by triggering Internet Identity login and creating a Stripe checkout session for paid tiers.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe integration, allowing entry and saving of a Stripe secret key and allowed countries, with visibility toggle and edit mode.",
  "frontend/src/pages/SubscriptionManagement.tsx": "Page for authenticated users to view their current subscription tier, associated features, and navigate to upgrade options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors (using CSS variables), fonts, border radii, box shadows, keyframe animations, and enabling the animate and typography plugins.",
  "project_state.json": "Project state metadata tracking existing features, a pending fix request to correct backend canister ID bindings in the frontend, and a known 404 canister-not-found production error."
}