{
  "backend/main.mo": "Main Motoko actor for the Viral Growth OS backend, handling user subscriptions (Free/Pro/Elite tiers), feature access control, brand voice profiles, content generation requests, Stripe checkout integration, and user profile management.",
  "feature_evidence.json": "Feature evidence report mapping the Elite tier price display update feature (from incorrect price to $99/month) to the file `frontend/src/pages/PricingPage.tsx` with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing the purpose and key changes of each component, page, hook, and style file in the project.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide for publishing the Viral Growth OS to the Internet Computer mainnet, covering prerequisites like DFX CLI installation, cycles wallet setup, and identity configuration.",
  "frontend/docs/STRIPE_SETUP.md": "Step-by-step guide for creating Pro and Elite Stripe subscription products, configuring webhooks, updating backend price IDs, and testing the checkout flow with troubleshooting tips.",
  "frontend/index.css": "Root Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the Viral Growth OS frontend, setting metadata, favicon, viewport, and mounting the React app via `/src/main.tsx`.",
  "frontend/src/App.tsx": "Root React application component that sets up TanStack Router with all page routes, wraps the app in ThemeProvider and QueryClientProvider, and orchestrates global profile setup modal display for newly authenticated users via the AppShell component.",
  "frontend/src/components/ContentOutput.tsx": "Displays generated content (hooks, scripts, captions) in cards with copy-to-clipboard functionality, meta badges for platform/niche/tone, and upgrade prompts for locked features.",
  "frontend/src/components/ContentScoreCard.tsx": "Renders a card showing hook strength, retention potential, and monetization potential as color-coded progress bars with an averaged overall score.",
  "frontend/src/components/CountdownTimer.tsx": "Displays a promotional countdown timer set 7 days from page load, showing days/hours/minutes/seconds with an expired fallback message.",
  "frontend/src/components/FeatureCarousel.tsx": "Auto-advancing image carousel showcasing three product features (hooks, scripts, monetization) with navigation controls and pause-on-hover behavior.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with animated headline, subtext, and CTA buttons that differ based on authentication state (generate vs. pricing).",
  "frontend/src/components/LandingPageNav.tsx": "Horizontal navigation bar for the landing page that highlights the active section using scroll-spy and smooth-scrolls to sections on click.",
  "frontend/src/components/Layout.tsx": "App shell with a sticky header containing the logo, context-aware navigation (landing vs. app pages), auth login/logout button, and mobile menu toggle.",
  "frontend/src/components/LegalDisclaimer.tsx": "Small alert component displaying a legal notice reminding users they are responsible for compliance of generated content.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a new user's name and email on first visit, saving the profile via the `useSaveCallerUserProfile` mutation and showing toast feedback.",
  "frontend/src/components/TestimonialsSection.tsx": "A landing-page section that renders three hardcoded creator testimonial cards with star ratings, quotes, and author info, using scroll-animation hooks for entrance effects.",
  "frontend/src/components/UpgradePrompt.tsx": "A small UI component that displays a locked-feature message with the required plan tier and a styled upgrade button linking to the pricing page.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, reinitializing and invalidating dependent queries whenever the Internet Identity changes.",
  "frontend/src/hooks/useCarousel.ts": "A hook managing carousel state with auto-advance interval, manual next/prev/goTo navigation, and pause/resume controls.",
  "frontend/src/hooks/useCountdown.ts": "A hook that counts down to a given target date, updating state every second and returning days, hours, minutes, seconds, and an expiry flag.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the authenticated caller's user profile from the backend actor, merging actor-loading state into the returned query object.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP AuthClient lifecycle, login/logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks and mutations for all backend interactions including user profile, subscription, Stripe checkout, tier checks, content generation, and admin operations.",
  "frontend/src/hooks/useRippleEffect.ts": "A hook that attaches a CSS ripple animation to a button element on click, respecting the user's `prefers-reduced-motion` setting.",
  "frontend/src/hooks/useScrollAnimation.ts": "Provides two React hooks using IntersectionObserver: `useScrollAnimation` adds an 'in-view' class to a single element when it enters the viewport, and `useScrollAnimationGroup` does the same for multiple child elements matching a CSS selector. Both respect the `prefers-reduced-motion` media query.",
  "frontend/src/hooks/useScrollSpy.ts": "React hook that observes a list of section IDs with IntersectionObserver and returns the ID of the currently visible section, enabling active-state tracking for navigation.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light and dark color themes using OKLCH values, and declares keyframe animations (fade-in, slide-up, ripple, etc.) used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `ReactQueryProvider`, `InternetIdentityProvider`, and the root `App` component into the DOM.",
  "frontend/src/pages/ContentGenerator.tsx": "Page component that lets authenticated users fill out a form (niche, platform, tone, audience, goal) and generate viral hooks, scripts, and captions via backend mutation hooks, displaying results in a `ContentOutput` component with tier-gated features.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page for authenticated users showing their subscription tier, enabled feature set, and content request history, with links to upgrade or start generating content.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page composed of a hero section, stats bar, feature grid, how-it-works steps, testimonials, and CTA buttons, with scroll animations applied to each section group.",
  "frontend/src/pages/PaymentFailure.tsx": "Static page shown after a cancelled or failed payment, offering buttons to retry on the pricing page or return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Page shown after a successful payment that invalidates subscription and feature-set queries to refresh state, then presents links to the dashboard and content generator.",
  "frontend/src/pages/PricingPage.tsx": "Renders a three-tier pricing page (Free, Pro, Elite) with plan details, features, and Stripe checkout integration via Internet Identity authentication.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe integration by entering a secret key and allowed countries, with validation and display of webhook URL.",
  "frontend/src/pages/SubscriptionManagement.tsx": "Displays the authenticated user's current subscription tier, its features, and provides a link to upgrade via the pricing page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with CSS variable-based colors, vibrant palette tokens, custom fonts, border radii, glow box shadows, and animation keyframes.",
  "project_state.json": "Project state metadata tracking existing features, known issues (Elite tier price incorrect), and a pending backend fix request to reflect the $99 Elite tier price."
}