{
  "backend/main.mo": "Main Motoko actor for the Viral Growth OS backend, handling user subscriptions (free/pro/elite tiers), content generation requests, brand voice profiles, user profiles, and Stripe checkout/webhook integration with access control.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (Internet Identity login/logout, first-login profile setup modal, and post-login dashboard redirect) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document providing one-sentence summaries of each frontend source file, serving as a quick reference for the purpose and recent changes of every component, page, hook, and style file.",
  "frontend/docs/DEPLOYMENT.md": "Deployment guide for publishing the Viral Growth OS to the Internet Computer mainnet, covering prerequisites (DFX CLI, cycles wallet, identity setup) and the build/deploy steps.",
  "frontend/docs/STRIPE_SETUP.md": "Step-by-step guide for creating Pro and Elite Stripe subscription products, configuring webhooks, updating backend price IDs, and testing the checkout flow with troubleshooting tips.",
  "frontend/index.css": "Root Tailwind CSS entry point defining OKLCH-based CSS custom properties for the light and dark color themes used throughout the application.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Viral Growth OS | PopTechSavvy' and mounting the React root div.",
  "frontend/src/App.tsx": "Root React component that configures TanStack Router with all application routes, wraps the app in ThemeProvider and QueryClientProvider, and uses AppShell to globally orchestrate the first-login ProfileSetupModal and navigation.",
  "frontend/src/components/ContentOutput.tsx": "Displays generated content (hooks, scripts, captions) in cards with copy-to-clipboard functionality, meta badges, and upgrade prompts for locked features based on the user's feature set.",
  "frontend/src/components/ContentScoreCard.tsx": "Renders a card showing hook strength, retention potential, and monetization potential scores as color-coded progress bars with an average score and optional virality explanation.",
  "frontend/src/components/CountdownTimer.tsx": "Displays a promotional countdown timer with days, hours, minutes, and seconds until a fixed 7-day deadline, showing an expiry message when the offer ends.",
  "frontend/src/components/FeatureCarousel.tsx": "An auto-advancing image carousel showcasing three product features (Viral Hook Generator, Platform-Optimized Scripts, Monetization Intelligence) with navigation controls and pause-on-hover behavior.",
  "frontend/src/components/HeroSection.tsx": "Landing page hero section with animated headline, subtext, and a CTA button that routes authenticated users to content generation or unauthenticated users to pricing.",
  "frontend/src/components/LandingPageNav.tsx": "A desktop navigation bar for the landing page that highlights the active section using scroll-spy and smoothly scrolls to sections on click.",
  "frontend/src/components/Layout.tsx": "Main app layout component providing a sticky header with logo, responsive navigation links, admin links, and Internet Identity login/logout functionality.",
  "frontend/src/components/LegalDisclaimer.tsx": "A small alert component displaying a legal notice reminding users they are responsible for their generated content and compliance with laws and platform terms.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a new user's name and email on first visit, saving the profile via the `useSaveCallerUserProfile` mutation and showing toast notifications on success or failure.",
  "frontend/src/components/TestimonialsSection.tsx": "A landing-page section that renders three hardcoded creator testimonial cards with star ratings, quotes, and author info, using scroll-animation hooks for staggered entrance effects.",
  "frontend/src/components/UpgradePrompt.tsx": "A small UI component that displays a locked-feature message with the required subscription tier and a styled upgrade button linking to the pricing page.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an ICP backend actor (anonymous or authenticated) using React Query, and invalidates all dependent queries whenever the actor instance changes.",
  "frontend/src/hooks/useCarousel.ts": "A hook that manages carousel state with auto-advance on a configurable interval, manual next/prev/goTo navigation, and pause/resume controls.",
  "frontend/src/hooks/useCountdown.ts": "A hook that counts down to a given target `Date`, updating state every second and returning days, hours, minutes, seconds, and an `isExpired` flag.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "A React Query hook that fetches the authenticated caller's user profile from the backend actor, merging actor-loading state into the returned `isLoading` flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that manage ICP Internet Identity authentication, exposing login/clear functions and status flags backed by `AuthClient`.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks and mutations for all backend interactions, including user profile, subscription, Stripe checkout, tier/feature checks, content generation, and brand voice operations.",
  "frontend/src/hooks/useRippleEffect.ts": "A hook that attaches a CSS ripple animation to a button element on click, respecting the user's `prefers-reduced-motion` setting.",
  "frontend/src/hooks/useScrollAnimation.ts": "Provides two React hooks using IntersectionObserver: `useScrollAnimation` adds an 'in-view' class to a single element when it enters the viewport, and `useScrollAnimationGroup` does the same for multiple child elements matching a CSS selector. Both respect the `prefers-reduced-motion` media query.",
  "frontend/src/hooks/useScrollSpy.ts": "React hook that observes a list of section IDs with IntersectionObserver and returns the ID of the currently visible section, enabling active-state highlighting in navigation.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines CSS custom properties for light and dark color themes using OKLCH values, and declares keyframe animations (fade-in, slide-up, ripple, etc.) used throughout the app.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `ReactQueryProvider` and `InternetIdentityProvider` wrappers around the root `App` component.",
  "frontend/src/pages/ContentGenerator.tsx": "Page component that provides a form for authenticated users to generate viral content (hooks, scripts, captions) by selecting niche, platform, tone, audience, and goal, then calling backend mutation hooks and displaying results via `ContentOutput`.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page for authenticated users showing their subscription tier, enabled feature set, and content request history, with links to upgrade or start generating content.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page composed of a hero section, stats bar, feature grid, how-it-works steps, testimonials, and CTA sections, with scroll animations and ripple effects applied throughout.",
  "frontend/src/pages/PaymentFailure.tsx": "Static page displayed after a cancelled or failed payment, informing the user they were not charged and offering buttons to retry or return to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Page shown after a successful payment that invalidates subscription-related queries to refresh state and provides navigation links to the dashboard and content generator.",
  "frontend/src/pages/PricingPage.tsx": "Renders a three-tier pricing page (Free, Pro, Elite) with plan details, feature lists, and Stripe checkout integration. Handles unauthenticated users by prompting login before redirecting to checkout.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe integration by entering a secret key and allowed countries. Shows current configuration status and webhook URL for IC mainnet deployments.",
  "frontend/src/pages/SubscriptionManagement.tsx": "Displays the authenticated user's current subscription tier, its features, and billing status, with an option to upgrade via a link to the pricing page.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both query strings and hash-based routes, with sessionStorage persistence helpers and a function to clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based color tokens, vibrant palette colors, custom fonts, glow box shadows, and animation keyframes.",
  "project_state.json": "Tracks project state including completed features (Internet Identity login, profile setup modal, dashboard redirect) and pending tasks (authenticated backend actor initialization) for the content creator SaaS app."
}