{
  "kind": "build_request",
  "title": "Fix 404 canister ID not found error on production",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the correct canister ID is embedded in frontend/index.html meta tag so the ICP0.io gateway can resolve the frontend canister. Verify the canister ID in the meta tag matches the deployed frontend canister ID exactly, and that it is present at page load before any JS executes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "i tried it again and is showing error 404 canister id not found"
        ]
      },
      "acceptanceCriteria": [
        "The <meta name='dfinity-canister-id'> tag in frontend/index.html contains the correct deployed frontend canister ID",
        "Loading the production URL no longer returns a 404 canister not found error",
        "The app loads successfully on the ICP0.io gateway"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the backend canister ID referenced in the frontend actor configuration (useActor.ts and any generated declarations) matches the deployed backend canister ID. Regenerate or update canister ID bindings if there is a mismatch.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "error 404 canister id not found"
        ]
      },
      "acceptanceCriteria": [
        "The backend canister ID used in actor initialization matches the deployed backend canister",
        "No 404 errors are thrown when the frontend attempts to communicate with the backend canister"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Audit the dfx.json and canister configuration to confirm that frontend and backend canister IDs are consistently defined and that the deployment targets the correct network (ic mainnet). Fix any misconfigured canister IDs or network targets.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "error 404 canister id not found"
        ]
      },
      "acceptanceCriteria": [
        "dfx.json references the correct canister IDs for both frontend and backend on the ic network",
        "Deployment produces no canister-not-found errors"
      ]
    }
  ],
  "constraints": [
    "Do not change application logic, UI, or feature behavior — this is a deployment configuration fix only",
    "Do not modify files under frontend/src/hooks/ (immutable paths)"
  ],
  "nonGoals": [
    "Adding new features or UI changes",
    "Modifying backend business logic",
    "Changing authentication flow"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}