{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix 404 canister ID not found error on production",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure the correct canister ID is embedded in frontend/index.html meta tag so the ICP0.io gateway can resolve the frontend canister",
      "acceptanceCriteria": [
        "The <meta name='dfinity-canister-id'> tag in frontend/index.html contains the correct deployed frontend canister ID",
        "Loading the production URL no longer returns a 404 canister not found error",
        "The app loads successfully on the ICP0.io gateway"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the <meta name='dfinity-canister-id'> tag to use the correct deployed frontend canister ID. The current value 'xzgjg-tiaaa-aaaal-qndgq-cai' must be replaced with the actual frontend canister ID from the deployment. Verify this canister ID matches the output of 'dfx canister id frontend --network ic' before deployment."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the backend canister ID referenced in the frontend actor configuration matches the deployed backend canister ID",
      "acceptanceCriteria": [
        "The backend canister ID used in actor initialization matches the deployed backend canister",
        "No 404 errors are thrown when the frontend attempts to communicate with the backend canister"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Verify that the backend canister ID used in actor initialization matches the deployed backend canister ID from 'dfx canister id backend --network ic'. If the canister ID is hardcoded or derived from environment variables, ensure it references the correct production backend canister. If using generated declarations, regenerate them with 'dfx generate backend --network ic' to ensure canister IDs are up to date."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Audit the dfx.json and canister configuration to confirm that frontend and backend canister IDs are consistently defined and that the deployment targets the correct network (ic mainnet)",
      "acceptanceCriteria": [
        "dfx.json references the correct canister IDs for both frontend and backend on the ic network",
        "Deployment produces no canister-not-found errors"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Cross-check the canister ID in the <meta name='dfinity-canister-id'> tag against the canister_ids.json file (or .dfx/ic/canister_ids.json) to ensure consistency. If canister_ids.json is missing or outdated, regenerate it by deploying to the ic network with 'dfx deploy --network ic'. This operation ensures the frontend HTML references the same canister ID that dfx.json defines for the ic network."
        }
      ]
    }
  ]
}