{
  "backend/main.mo": "Main actor implementing subscription management with Stripe integration, user profiles, brand voice profiles, content generation requests, and tier-based feature access control with admin authorization.",
  "backend/migration.mo": "Migration module that transforms old actor state to new state by adding customerId field to UserSubscription records while preserving all other data structures.",
  "feature_evidence.json": "Feature evidence report documenting three Stripe integration features: setup page for API keys, checkout initiation from pricing page, and subscription management with customer portal access.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend files including components, pages, hooks, and configuration files for the content generation platform.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Viral Growth Operating System application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, pricing, dashboard, subscription, content generator, payment callbacks, and Stripe setup, wrapped in theme provider with toast notifications.",
  "frontend/src/components/ContentOutput.tsx": "Component rendering generated content sections (hooks, scripts, captions, hashtags, monetization angles, scores, etc.) with tier-based feature gating and upgrade prompts for locked features.",
  "frontend/src/components/ContentScoreCard.tsx": "Displays AI-powered content performance metrics (hook strength, retention potential, monetization potential) with progress bars and color-coded scores, plus a virality analysis explanation.",
  "frontend/src/components/Layout.tsx": "Main application layout component with sticky header, navigation (desktop/mobile), authentication state handling, and footer with legal links and social media.",
  "frontend/src/components/LegalDisclaimer.tsx": "Displays a legal notice alert explaining user rights to generated content, AI limitations, and compliance responsibilities.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email, blocking interaction until profile is created.",
  "frontend/src/components/UpgradePrompt.tsx": "Card component that displays a locked feature message and prompts users to upgrade to Pro or Elite tier with a link to pricing page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state and initializing access control with optional admin token.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profiles, subscriptions, feature sets, content generation requests, Stripe checkout, and admin functions with mock fallback data for content generation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, energetic color palette for light and dark modes, including primary coral-orange colors, chart colors, and sidebar theming.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/ContentGenerator.tsx": "Content generation page with a form for users to input content strategy parameters (tone, audience, platform, niche, goal) and display AI-generated content results.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard displaying subscription status, tier-based features, and content request history with navigation to content generation.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showcasing the AI content generation platform with hero section, feature cards, and call-to-action buttons for authentication and pricing.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation confirmation page with options to retry payment or return to dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that invalidates subscription cache and provides navigation to dashboard or content generation.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying three subscription tiers (Free, Pro, Elite) with feature comparisons and Stripe checkout integration for paid plans.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe API credentials (secret key and allowed countries) with authentication checks, form validation, and success/error feedback.",
  "frontend/src/pages/SubscriptionManagement.tsx": "User subscription management page displaying current plan tier, status, billing cycle, and upgrade options with tier-based UI styling and external Stripe billing portal integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH, typography, container settings, custom shadows, animations, and design tokens for the UI component library.",
  "project_state.json": "Project metadata defining an AI-powered SaaS platform for content creators with tiered subscriptions (Free/Pro/Elite), architectural notes on payment processing, copyright compliance, and existing implemented features."
}