{
  "backend/main.mo": "Main backend actor implementing subscription management with Stripe integration, user profiles, brand voice profiles, content generation requests, and tier-based feature access control (Free/Pro/Elite) with hardcoded Stripe price IDs and webhook handling.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: Stripe product setup with Pro/Elite tiers and end-to-end subscription flow testing with tier upgrades and feature unlocking.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including routing, subscription management, payment flows, content generation with tier gating, and Stripe setup pages with immediate cache invalidation after upgrades.",
  "frontend/docs/STRIPE_SETUP.md": "Step-by-step guide for creating Pro ($29/month) and Elite ($79/month) subscription products in Stripe dashboard, configuring webhooks, and testing checkout flow with hardcoded price IDs already in backend.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system featuring warm coral-orange primary colors, custom chart colors, and both light and dark mode theme definitions.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for React mounting, titled 'Viral Growth Operating System'.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for landing, pricing, dashboard, subscription, content generator, payment success/failure, and Stripe setup, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/ContentOutput.tsx": "Component displaying generated content sections (hooks, scripts, captions, hashtags, monetization angles, etc.) with tier-based feature gating showing upgrade prompts for locked features based on FeatureSet.",
  "frontend/src/components/ContentScoreCard.tsx": "Displays AI-powered content performance scores (hook strength, retention potential, monetization potential) with progress bars and color-coded ratings, plus a virality analysis explanation.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, mobile menu, login/logout functionality, and footer with legal links and social media icons.",
  "frontend/src/components/LegalDisclaimer.tsx": "Displays a legal notice alert explaining user rights to generated content, AI assistance limitations, and compliance responsibilities.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email, blocking interaction until profile is created.",
  "frontend/src/components/UpgradePrompt.tsx": "Card component that displays a locked feature message and prompts users to upgrade to Pro or Elite tier with a link to pricing page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, handling identity changes and invalidating dependent queries when actor updates.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, subscription queries, feature access checks, content generation requests, and Stripe/shopping cart operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, energetic color palette for light and dark modes, including primary coral-orange colors, chart colors, and sidebar theming.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/ContentGenerator.tsx": "Content generation page with a form for users to input content strategy parameters (tone, audience, platform, niche, goal) and displays AI-generated content output with tier-based access control.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard displaying subscription status, tier-based features, and recent content requests with navigation to content generation and subscription management.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature grid showcasing AI content generation capabilities, and call-to-action buttons for authentication and pricing.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation page displaying failure message with options to retry payment or return to dashboard/pricing.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that invalidates subscription queries to refresh tier data and provides navigation to dashboard or content generation.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying three subscription tiers (Free, Pro, Elite) with feature comparisons and Stripe checkout integration for paid tier upgrades.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe payment integration, allowing administrators to set secret keys and allowed countries with validation and status display.",
  "frontend/src/pages/SubscriptionManagement.tsx": "User subscription management page displaying current tier (Free/Pro/Elite), status, and billing controls with links to Stripe customer portal and upgrade options.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH, typography, container settings, animations, and design tokens for the UI system.",
  "project_state.json": "Project metadata defining the AI-powered SaaS platform architecture with tiered subscription model (Free/Pro/Elite), content generation features, payment integration, and copyright compliance requirements."
}