{
  "backend/main.mo": "Main backend actor implementing subscription management (Free/Pro/Elite tiers), user profiles, content generation requests, brand voice profiles, and Stripe integration with role-based access control for all operations.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs, covering authentication, content output display, scoring, upgrade prompts, and legal disclaimers.",
  "frontend-file-summaries.txt": "JSON object containing one-line summaries of all frontend files including pages, components, hooks, and configuration files for the content generation platform.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with neutral grays, chart colors, and CSS custom properties for light and dark themes.",
  "frontend/index.html": "HTML entry point with root div and module script loading for the Viral Growth Operating System application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, pricing, dashboard, subscription, content generation, and payment pages, wrapped in theme provider with toast notifications.",
  "frontend/src/components/ContentOutput.tsx": "Comprehensive content display component rendering all 10 content sections (hooks, scripts, captions, hashtags, monetization, triggers, posting recommendations, pain points, scores, calendar, roadmap, faceless version) with tier-based feature gating and upgrade prompts.",
  "frontend/src/components/ContentScoreCard.tsx": "Card component displaying three performance scores (hook strength, retention potential, monetization potential) as 1-10 ratings with progress bars, color-coded indicators, and virality explanation text.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (desktop and mobile), logo, and authentication-aware routing to dashboard, generate, subscription, and pricing pages.",
  "frontend/src/components/LegalDisclaimer.tsx": "Displays a legal notice alert stating that generated content is original work, users retain commercial rights, and users are responsible for compliance verification.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter name and email to create their user profile.",
  "frontend/src/components/UpgradePrompt.tsx": "Card component that displays a locked feature message and prompts users to upgrade to a required tier (Pro or Elite) with a link to the pricing page.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks and mutations for user profile, subscription, feature set, and content generation operations with the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm, energetic color palette for light and dark modes, including chart colors and sidebar theming.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ContentGenerator.tsx": "Main content generation page with a form for users to input content strategy parameters (tone, audience, platform, niche, goal) and display AI-generated content results. Requires authentication and integrates with backend hooks for content generation and request tracking.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard displaying subscription tier status, feature limits, and recent content requests history. Shows tier-specific capabilities (hooks, scripts, captions) and provides quick access to create new content.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showcasing the AI content generation platform with hero section, feature grid highlighting trend analysis and performance scoring, and call-to-action buttons directing to dashboard or pricing.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation confirmation page displaying an error state with options to retry by viewing pricing or return to dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that invalidates subscription cache to refetch updated tier and provides navigation to dashboard or content generation.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying three subscription tiers (Free, Pro, Elite) with feature comparisons and tier selection that routes authenticated users to subscription flow or dashboard.",
  "frontend/src/pages/SubscriptionManagement.tsx": "Subscription management page showing current plan details, billing status, and upgrade options for users not on the elite tier.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, custom font families (Inter, Cal Sans), and extended design tokens for a component-based UI system.",
  "project_state.json": "Project state document describing an AI-powered SaaS platform for content creators with tiered subscription access (Free/Pro/Elite), featuring content generation, trend analysis, monetization optimization, and strict copyright compliance requirements."
}