{
  "backend/main.mo": "Main actor implementing subscription management (Free/Pro/Elite tiers), user profiles, brand voice, content generation requests, Stripe integration, and role-based access control with feature gating based on subscription tier.",
  "backend/migration.mo": "Migration module that ensures stripeConfig is initialized with a default test key and empty allowedCountries array if not present in the old actor state.",
  "feature_evidence.json": "Feature evidence report documenting that the StripeSetup page auto-detection and confirmation message feature has been implemented with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including pages, components, hooks, and configuration, with StripeSetup.tsx showing success state when configured or form for initial setup.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, featuring neutral grayscale palette with chart colors and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script loading main.tsx for the Viral Growth Operating System application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for landing, pricing, dashboard, subscription, content generator, payment success/failure, and Stripe setup, wrapped in ThemeProvider with toast notifications.",
  "frontend/src/components/ContentOutput.tsx": "Displays generated content sections (hooks, scripts, captions, hashtags, monetization angles, scores, calendar, roadmap, faceless version) with tier-based feature gating showing upgrade prompts for locked features.",
  "frontend/src/components/ContentScoreCard.tsx": "Card component displaying three content performance metrics (hook strength, retention potential, monetization potential) with progress bars, color-coded scores, and virality explanation text.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation menu (desktop and mobile), authentication-aware routing, and footer with legal links. Includes ProfileSetupModal and handles navigation to dashboard, generate, subscription, pricing, and admin pages.",
  "frontend/src/components/LegalDisclaimer.tsx": "Displays a legal notice alert component explaining user rights, content ownership, AI limitations, and compliance responsibilities for generated content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that appears for authenticated users without a profile, prompting them to enter name and email to create their user profile. Cannot be dismissed until completed.",
  "frontend/src/components/UpgradePrompt.tsx": "Card component that displays a locked feature message with upgrade call-to-action, directing users to the pricing page to unlock Pro or Elite tier features.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state, initializing with identity or anonymously, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "React Query hook that fetches the current authenticated user's profile from the backend actor, returning null if no profile exists.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations including user profile management, subscription queries, feature set checks, content request CRUD, content generation, tier management, shopping cart, Stripe configuration, and admin functions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens defining a warm, energetic color palette for light and dark modes, including vibrant chart colors and sidebar theming optimized for content creators.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/ContentGenerator.tsx": "Content generation page where authenticated users fill out a form (tone, audience, platform, niche, goal) to generate AI-powered viral content using hooks from useAddContentRequest and useGenerateContent.",
  "frontend/src/pages/Dashboard.tsx": "User dashboard displaying subscription tier status, feature limits (hooks, scripts, captions), and a list of recent content requests with navigation to create new content.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature grid showcasing AI content generation capabilities, and call-to-action buttons directing users to pricing or dashboard.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment cancellation confirmation page informing users no charges were made, with options to retry pricing or return to dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success confirmation page that invalidates subscription cache to refetch updated tier and provides navigation to dashboard or content generation.",
  "frontend/src/pages/PricingPage.tsx": "Pricing page displaying three subscription tiers (Free, Pro, Elite) with feature comparisons and Stripe checkout integration via useCreateStripeCheckoutSession hook.",
  "frontend/src/pages/StripeSetup.tsx": "Admin-only page for configuring Stripe payment integration by entering secret key and allowed country codes, with validation and configuration status display.",
  "frontend/src/pages/SubscriptionManagement.tsx": "React page component for managing user subscriptions, displaying current plan tier (Free/Pro/Elite), status, and billing cycle with upgrade prompts and Stripe billing portal integration.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, typography, container queries, animations, and design tokens for a modern UI system.",
  "project_state.json": "Project metadata defining an AI-powered SaaS platform for content creators with tiered subscriptions (Free/Pro/Elite), featuring content generation, trend analysis, and strict copyright compliance requirements."
}